---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsConstructionMethod.CastInPlace
enum: Autodesk.Revit.DB.Architecture.StairsConstructionMethod
source: html/baaba95a-8e1d-d002-2431-baaef362f060.htm
---
# Autodesk.Revit.DB.Architecture.StairsConstructionMethod.CastInPlace

The stairs is constructed by cast-in-place method.